Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You supply the gamepad "slot" to set the option on, as well as the option string to set and the value to use.
zh_cn: 您提供游戏手柄"插槽"来设置选项，以及要设置的选项字符串和使用的值。

source: You supply the gamepad slot index to check, along with either a button constant (as listed here), or an integer value between 0 and gamepad_button_count() -1.
zh_cn: 您可以提供手柄插槽索引进行检查，以及按钮常量(如这里所列)或0到gamepad_button_count() -1之间的整数值。

source: You supply the gamepad slot index to check, along with either an axis index constant (as listed here), or an integer value between 0 and gamepad_axis_count()-1.
zh_cn: 您需要提供游戏手柄插槽索引，以及一个轴索引常量(如这里所列)，或者一个介于0和gamepad_axis_count()-1之间的整数值。

source: You supply the gamepad slot to check (from 0 - 11), and the function will return one of the following strings:
zh_cn: 你提供手柄插槽来检查(从0到11)，函数将返回以下字符串之一:

source: You supply the global variable name to check for as a string (see example code below) and the function will return true if a global variable with the given name exists or false otherwise.
zh_cn: 将全局变量名作为字符串提供以进行检查(参见下面的示例代码)，如果存在具有给定名称的全局变量，则函数将返回true，否则返回false。

source: You supply the index number for the bounding box to get the details of (you can retrieve the total number of bounding boxes for the sprite using the function skeleton_get_num_bounds()) and the function will return an array with the following elements:
zh_cn: 您提供边界框的索引号以获取其详细信息(您可以使用skeleton_get_num_bounds()函数检索sprite的边界框总数)，此函数将返回一个包含以下元素的数组:

source: You supply the index of the render target to check, and the function will return -1 if no surface is assigned, or an integer value >= 0, representing the ID of the surface assigned (as returned by the function surface_create()).
zh_cn: 提供渲染目标的索引进行检查，如果没有分配表面，则函数将返回-1，或者返回一个整数值>= 0，表示分配的表面的ID(由函数surface_create()返回)。

source: You supply the index to for the room to be copied to (either as defined in the asset browser or as returned by the function room_add()) as well as the index of the source room. Note that calling this function on a room asset created in the Asset Browser will permanently change the contents of the room, and even calling game_restart() will not return the room to it's original state (only ending the game and opening it again will start with the room in its original state again).
zh_cn: 您提供要复制到的房间的索引(可以是在资源浏览器中定义的，也可以是由函数room_add()返回的)以及源房间的索引。注意，在资源浏览器中创建的房间资源上调用此函数将永久地改变房间的内容，甚至调用game_restart()也不会将房间返回到它的原始状态(只有结束游戏并再次打开它时，房间才会重新回到它的原始状态)。

source: You supply the index to the map (as returned by the function ds_map_create()) and then the key to replace - either a string or an integer - and the value to replace the key value with.
zh_cn: 您可以向map提供索引(如函数ds_map_create()所返回的那样)，然后是要替换的键—字符串或整数—以及要替换键值的值。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return a value of 0 for full resolution, 1 for the first mipmap, 2 for the second etc...
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将为全分辨率返回值0，为第一个mipmap返回值1，为第二个mi pmap返回值2，依此类推...

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return a value of 0.0 for no bias, or a greater value where 1 equals the first mipmap, 2 equals the second mipmap etc...
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将返回0.0的无偏差值，或者更大的值，其中1等于第一个小中见大贴图，2等于第二个小中见大贴图，依此类推...

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return a value within the range of 1 and 16.
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将返回1到16范围内的值。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return one of the constants listed below.
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将返回下面列出的常量之一。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return one of the mode value constants listed below.
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将返回下面列出的模式值常量之一。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and the function will return the current maximum mipmap level, where a value of 0 is the highest resolution, 1 is to use the first mipmap, 2 is the second etc...
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，此函数将为当前最大分辨率返回值0，为第一个mipmap返回值1，为第二个mipmap返回值2，依此类推...

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and then a value within the range of 1 and 16 to set the level.
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，然后提供1到16范围内的值来设置级别。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and then give a value, where 0 is for full resolution, 1 is for the first mipmap, 2 for the second etc...
zh_cn: 你为着色采样器提供索引值(由shader_get_sampler_index()函数返回)，然后给出一个值，其中0是完全分辨率，1是第一个mipmap, 2是第二个等等…

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and then one of the constants listed below.
zh_cn: 你为着色采样器提供索引值(由shader_get_sampler_index()函数返回)，然后是下面列出的一个常量。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and then one of the mode value constants listed below.
zh_cn: 您为着色器采样器提供索引值(由函数shader_get_sampler_index()返回)，然后提供下面列出的模式值常量之一。

source: You supply the index value for the shader sampler (as returned by the function shader_get_sampler_index(), and then the bias value, where 0 is for no bias, 1 equals the first mipmap, 2 equals the second mipmap etc...
zh_cn: 通过此函数，你可以为给定的着色采样器设置mipmap偏置值。

source: You supply the initial value to use (an array index or a struct reference) and then the function will "stringify" it, converting it into a JSON string, converting GameMaker arrays into JSON arrays, and GameMaker structs in to JSON objects.
zh_cn: 你提供使用的初始值(数组索引或结构引用)，然后函数将其"stringify"，将其转换为JSON字符串，将GameMaker数组转换为JSON数组，并将GameMaker结构转换为JSON对象。

source: You supply the instance ID to check, and the function will return an integer value for the number of variables encountered, or (if no instance of the given ID exists) -1.
zh_cn: 您提供实例ID进行检查，函数将返回遇到的变量数量的整数值，或者(如果给定ID的实例不存在)-1。

source: You supply the instance ID to use (it must be an instance that is active and in the room, and can't be an object ID) or a struct reference, as well as the ID of the function that you want to bind.
zh_cn: 您提供要使用的实例ID(它必须是活动的且在房间中的实例，不能是对象ID)或结构引用，以及要绑定的函数的ID。

source: You supply the layer ID (which you get when you create the layer using layer_create() or when you use the layer name along with layer_get_id()) and the name of the sprite element as defined in the Room Editor.
zh_cn: 你提供层ID(当你使用layer_create()创建层时，或当你使用层名和layer_get_id()时)和房间编辑器中定义的精灵元素的名称。

source: You supply the layer ID (which you get when you create the layer using layer_create() or when you use the layer name along with layer_get_id()), a position within the room, and a sprite index (which would be the name of the sprite as shown in the Asset Browser), and it will be added to the layer.
zh_cn: 你提供层ID(当你使用layer_create()创建层或当你使用layer_get_id()层名时获得)，房间内的位置，和精灵索引(这将是在资源浏览器中显示的精灵的名称)，它将被添加到层。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and a sprite index (which would be the name of the sprite as shown in the Asset Browser), and it will be added to the layer.
zh_cn: 您提供层ID(使用layer_create()创建层时获得)或层名称(作为字符串-这将影响性能)和精灵索引(将是资源浏览器中显示的精灵名称)，它将被添加到层。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()) and the function will return either true if the element exists, or false if it does not.
zh_cn: 提供图层ID(使用layer_create()创建图层时获得)或图层名称(以字符串形式，这将影响性能)和背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，如果元素存在，函数将返回true，否则返回false。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function returns a real number for the horizontal speed, where a positive value is to the right and a negative value to the left.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，函数返回水平速度的实数，其中正值为右，负值为左。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function returns a real number for the vertical speed, where a positive value is down and a negative value up.
zh_cn: 您可以提供图层ID(在使用layer_create()创建图层时获得)或图层名称(以字符串形式，这将对性能产生影响),函数将返回垂直速度的实数，其中正值表示向下，负值表示向上。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function returns a real number for the x position of the layer, relative to the (0,0) position of the room.
zh_cn: 您可以提供层ID(在使用layer_create()创建层时获得)或层名称(作为一个字符串，这将影响性能),此函数返回层的x位置的实数，相对于房间的(0，0)位置。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will move the layer the given number of pixels along the horizontal axis of the room.
zh_cn: 您可以提供层ID(在使用layer_create()创建层时获得)或层名(作为字符串—这将影响性能)，函数将沿房间的水平轴移动层的给定像素数。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will move the layer the given number of pixels along the vertical axis of the room.
zh_cn: 您可以提供层ID(在使用layer_create()创建层时获得)或层名(作为字符串—这将影响性能)，函数将沿房间的垂直轴移动层的给定像素数。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will return a boolean value of true if it exists or false if it does not.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，函数将返回布尔值true如果存在，false如果不存在。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will return an array of IDs, where each entry in the array is a unique ID for an element on that layer.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，函数将返回一个ID数组，其中数组中的每个条目是该层上一个元素的唯一ID。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will return that layers depth as a real number.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，函数将返回层深度作为实数。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will return the ID value associated with the tile map element on the layer.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，函数将返回与层上的tile map元素相关的ID值。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the function will return true if it is visible, and false otherwise.
zh_cn: 您可以提供图层ID(在使用layer_create()创建图层时获得)或图层名称(作为字符串，这将影响性能),如果可见，函数将返回true，否则返回false。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the instance ID of the instance to check for.
zh_cn: 您提供层ID(使用layer_create()创建层时获得)或层名称(作为字符串，这将影响性能)以及要检查的实例的实例ID。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the instance ID of the instance to move between layers.
zh_cn: 您可以提供层ID(使用layer_create()创建层时获得)或层名称(作为字符串，这将影响性能)以及实例的实例ID，以便在层之间移动。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the speed value to set, where a positive value is downwards and a negative value upwards.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)和速度值设置，其中正值向下和负值向上。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the speed value to set, where a positive value is to the right and a negative value to the left.
zh_cn: 您需要提供图层ID(使用layer_create()创建图层时获得)或图层名称(字符串形式，这将影响性能)以及要设置的速度值，其中正值在右侧，负值在左侧。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()) and the function will return either true if the element exists, or false if it does not.
zh_cn: 你提供层ID(当你使用layer_create()创建层时获得)或层名(作为字符串-这将有性能影响)和精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回true如果元素存在，或false如果它不存在。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and the tile map element ID (which you get when you create a tile map element using layer_tilemap_create() or when you use the function layer_tilemap_get_id()) and the function will return either true if the element exists, or false if it does not.
zh_cn: 您提供层ID(当您使用layer_create()创建层时获得)或层名(作为字符串-这将有性能影响)和tilemap元素ID(当您使用layer_tilemap_create()或使用layer_tilemap_get_id()函数创建tilemap元素时获得)，函数将返回true如果元素存在，或false如果它不存在。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and then an initial (x, y) position to add the tile map to the room, the tile set resource to use, and then the width and height of the tile map in cells (ie: a width of 20 and a height of 10 will create a tile map with 200 cells that is 20 cells wide and 10 cells tall), with the size of the cells themselves being defined by the tile set chosen.
zh_cn: 您提供层ID(使用layer_create()创建层时获得)或层名称(作为字符串，这将影响性能),然后提供初始(x，y)位置以将tile map添加到房间，要使用的图块集资源，然后是以单元为单位的tile map的宽度和高度(即:宽度为20，高度为10将创建具有200个单元的tile map，其中20个单元宽，10个单元高)，单元本身的大小由所选的图块集定义。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and then give the new depth to set it to (an integer value form -16000 to 16000).
zh_cn: 您可以提供图层ID(使用layer_create()创建图层时获得)或图层名称(作为字符串，这将对性能产生影响)，然后给出新的深度以将其设置为(一个从-16000到16000的整数值)。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and this function will return the script function index of the function assigned to run at the beginning of rendering for that layer, or it will return -1 if no function is assigned. You can assign script functions to a layer with layer_script_begin() and layer_script_end().
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，此函数将返回在该层渲染开始时分配运行的函数的脚本函数索引，或者如果没有分配函数，它将返回-1。可以使用layer_script_begin()和layer_script_end()将脚本函数分配给一个层。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) and this will remove it from the current room.
zh_cn: 你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，这将从当前房间删除它。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact), and the function will return either the shader index of the shader assigned, or -1 if no shader is assigned.
zh_cn: 您可以提供层ID(在使用layer_create()创建层时获得)或层名称(作为字符串，这将对性能产生影响)，函数将返回指定着色器的着色器索引，如果没有指定着色器，则返回-1。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact), and then all instances that are on the layer will be removed from the game, triggering their Destroy and Clean Up events.
zh_cn: 你提供层ID(当你使用layer_create()创建层时获得)或层名(作为字符串-这将有性能影响)，然后该层上的所有实例将从游戏中删除，触发它们的Destroy和Clean Up事件。

source: You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact).
zh_cn: 您可以提供图层ID(在使用layer_create()创建图层时获得)或图层名称(作为字符串，这将对性能产生影响)。

source: You supply the layer ID (which you get when you use the layer name along with layer_get_id()) and the function will return the ID value associated with the background element on the layer.
zh_cn: 你提供图层ID(当你使用图层名称和layer_get_id()时得到)，函数将返回与图层上的背景元素相关的ID值。

source: You supply the layer ID which can be a string of the layer name - as defined in the room editor - or the unique layer ID - as returned by the function layer_get_id(), as well as the X and Y position in the room to create the sequence at, and finally the ID of the sequence to create.
zh_cn: 您提供的层ID可以是层名的字符串(如在房间编辑器中定义的那样)，也可以是函数layer_get_id()返回的惟一层ID，以及要创建序列的房间中的X和Y位置，最后是要创建序列的ID。

source: You supply the layer ID which can be a string of the layer name - as defined in the room editor - or the unique layer ID - as returned by the function layer_get_id(), as well the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return true if the given element exists or false otherwise.
zh_cn: 你提供的层ID可以是层名的字符串-在房间编辑器中定义-或唯一的层ID -由函数layer_get_id()返回，以及序列元素ID -由layer_sequence_create()或由一个层元素函数返回-如果给定的元素存在，它将返回true，否则返回false。

source: You supply the low value for the range as well as the high value, and the function will return a random integer value within (and including) the given range.
zh_cn: 您提供范围的下限值和上限值，函数将返回给定范围内(包括)的随机整数值。

source: You supply the mouse button to check from one of the following constants:
zh_cn: 你提供鼠标按钮从以下常量之一进行检查:

source: You supply the name (and path) of the file, then the name of the function that you wish to define.
zh_cn: 先提供文件的名称(和路径)，然后再提供希望定义的函数的名称。

source: You supply the name of the global variable to get the value of as a string (see example code below) and the function will return the value held by the global variable or undefined if the variable does not exist.
zh_cn: 您提供全局变量的名称以获得字符串形式的值(参见下面的示例代码)，函数将返回由全局变量持有的值，如果变量不存在，则返回undefined。

source: You supply the name of the global variable to set the value of as a string (see example code below), and then the value to set (can be any valid data type).
zh_cn: 您提供全局变量的名称以字符串的形式设置值(参见下面的示例代码)，然后是要设置的值(可以是任何有效的数据类型)。

source: You supply the name of the previously defined function as well as each of the arguments it requires (each argument must be of the correct type, either real or string) and the function returns the result of the external call.
zh_cn: 您提供前面定义的函数的名称以及它需要的每个参数(每个参数必须是正确的类型，要么是real要么是string)，函数返回外部调用的结果。

source: You supply the particle system ID value (as returned by the function part_system_create_layer()) and the function will return the ID value of the layer.
zh_cn: 您提供粒子系统ID值(由函数part_system_create_layer()返回)，函数将返回层的ID值。

source: You supply the particle system ID value (as returned by the function part_system_create_layer()) and then the unique layer ID (as returned by the function layer_create() or the name of the layer to use as a string - for example "instance_layer" - as defined in the room editor), and the system will be moved to the new layer.
zh_cn: 您可以提供粒子系统ID值(由函数part_system_create_layer()返回)，然后是惟一的层ID(由函数layer_create()返回，或者作为字符串使用的层名——例如"instance_layer"——如在room编辑器中定义的那样)，然后系统将被移动到新层。

source: You supply the permission to check as a string using the format "android.permission.<permission>", so to check the RECORD_AUDIO permission (for example) you would call
zh_cn: 您使用"android.permission"格式将检查权限作为字符串提供。"，因此要检查RECORD_AUDIO权限(例如)，您将调用</permission>

source: You supply the room index (stored in the variable for the room name, or as a variable returned from the function room_add()).
zh_cn: 您提供房间索引(存储在房间名称的变量中，或作为从函数room_add()返回的变量)。

source: You supply the room index to set the view port in, the view port index (from 0 to 7) and then whether the view port should be visible at the start of the room or not (set to true to make the port visible, and false otherwise).
zh_cn: 您需要提供房间索引来设置视口，视口索引(从0到7)以及视口在房间开始时是否可见(设置为true以使视口可见，否则设置为false)。

source: You supply the room index, the view index (from 0 to 7) and then the index of the camera to use.
zh_cn: 您提供房间索引、视图索引(从0到7)以及要使用的相机的索引。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the X position to set and the sequence will be moved to the new position.
zh_cn: 您提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，并设置X位置，序列将被移动到新位置。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the Y position to set and the sequence will be moved to the new position.
zh_cn: 您提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，并设置Y位置，序列将被移动到新位置。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the new angle to set and the sequence will be rotated about its origin to the new position.
zh_cn: 你提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID以及要设置的新角度，序列将围绕其原点旋转到新位置。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the new position to set.
zh_cn: 您提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID以及要设置的新位置。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the new scale to set on the X axis and the sequence will be scaled by this amount. A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the width of the sequence), larger values will scale up and negative values will mirror the sequence about its origin and scale it unless the value used is exactly -1 (in which case the sequence is just mirrored about its origin with no scaling).
zh_cn: 你提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，并在X轴上设置新的比例，序列将按此比例缩放。1表示不进行缩放(1:1)，较小的值将按比例缩小(例如，0.5将是序列宽度的一半)，较大的值将按比例扩大，负值将按原点镜像序列并缩放它，除非所使用的值正好是-1(在这种情况下，序列仅按原点镜像，不进行缩放)。
